Управление_закупками/src/Documents/СчетКонтрагента/СчетКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетКонтрагента</name>
  <registerRecords>AccumulationRegister.ОстатокТовараПоСчету</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИзготовления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказаВПроизводство</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплатыСчета</name>
    <type>
      <types>EnumRef.УсловияОплатыСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкаНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>EnumRef.СтатусыПоставкиМатериала</types>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИзготовления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрытыеПотребности</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутреннийЗаказ</name>
      <type>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияПотребности</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗакрытоеПотребности</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияПоставщика</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗакрытоеПоСчету</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>БазоваяЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентЕдиницыИзмерения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПересчетаЕдиницИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьСверхобъем</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_закупками/src/AccumulationRegisters/ОстатокТовараПоСчету/ОстатокТовараПоСчету.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстатокТовараПоСчету</name>
  <resources>
    <name>КоличествоЗакрытоеПоСчету</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗакрытоеПотребности</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныеХарактеристикиНоменклатуры</name>
    <type>
      <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетКонтрагента</name>
    <type>
      <types>DocumentRef.СчетКонтрагента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПоставщика</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияПоставщика</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_закупками/src/Enums/СтавкаНДС/СтавкаНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкаНДС</name>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
  </enumValues>
</mdclass:Enum>

Управление_закупками/src/Documents/СчетКонтрагента/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)

	Префикс = "СК-"; 
	
КонецПроцедуры 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		
		Если ДанныеЗаполнения = Неопределено Тогда
			ЗаполнитьПоЗначениямАвтозаполнения(ДанныеЗаполнения)
		КонецЕсли;;

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если  Товары.Количество() = 0 Тогда
		
		Отказ = Истина;
		ТекстСообщения = "Документ не проведен.
						| В документе нет ни одной позициии материала.";   
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
		Возврат;
		
	КонецЕсли;
			
	Если Не ДанныеПровереныИГотовыКЗаписи() Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = "Ошибка. Документ не проведен.
				| Некоторые позиции в счете не полностью распределены по заявкам.";   
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		
	КонецЕсли;
	
	Движения.ОстатокТовараПоСчету.Записывать = Истина;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетКонтрагентаЗакрытыеПотребности.ВнутреннийЗаказ КАК ВнутреннийЗаказ,
		|	СчетКонтрагентаЗакрытыеПотребности.Номенклатура КАК Номенклатура,
		|	СчетКонтрагентаЗакрытыеПотребности.ДополнительныеХарактеристикиНоменклатуры КАК ДополнительныеХарактеристикиНоменклатуры,
		|	СчетКонтрагентаЗакрытыеПотребности.ЕдиницаИзмеренияПотребности КАК ЕдиницаИзмеренияПотребности,
		|	СчетКонтрагентаЗакрытыеПотребности.НоменклатураПоставщика КАК НоменклатураПоставщика,
		|	СчетКонтрагентаЗакрытыеПотребности.ЕдиницаИзмеренияПоставщика КАК ЕдиницаИзмеренияПоставщика,
		|	СУММА(СчетКонтрагентаЗакрытыеПотребности.КоличествоЗакрытоеПоСчету) КАК КоличествоЗакрытоеПоСчету,
		|	СУММА(СчетКонтрагентаЗакрытыеПотребности.КоличествоЗакрытоеПотребности) КАК КоличествоЗакрытоеПотребности
		|ИЗ
		|	Документ.СчетКонтрагента.ЗакрытыеПотребности КАК СчетКонтрагентаЗакрытыеПотребности
		|ГДЕ
		|	СчетКонтрагентаЗакрытыеПотребности.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетКонтрагентаЗакрытыеПотребности.ВнутреннийЗаказ,
		|	СчетКонтрагентаЗакрытыеПотребности.ЕдиницаИзмеренияПоставщика,
		|	СчетКонтрагентаЗакрытыеПотребности.ДополнительныеХарактеристикиНоменклатуры,
		|	СчетКонтрагентаЗакрытыеПотребности.ЕдиницаИзмеренияПотребности,
		|	СчетКонтрагентаЗакрытыеПотребности.НоменклатураПоставщика,
		|	СчетКонтрагентаЗакрытыеПотребности.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл

		Движение = Движения.ОстатокТовараПоСчету.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаСчета;
		Движение.ВнутреннийЗаказ = Выборка.ВнутреннийЗаказ;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.ДополнительныеХарактеристикиНоменклатуры = Выборка.ДополнительныеХарактеристикиНоменклатуры;
		Движение.ЕдиницаИзмерения = Выборка.ЕдиницаИзмеренияПотребности;
		Движение.СчетКонтрагента = Ссылка;
		Движение.НоменклатураПоставщика = Выборка.НоменклатураПоставщика;
		Движение.ЕдиницаИзмеренияПоставщика = Выборка.ЕдиницаИзмеренияПоставщика;
		Движение.КоличествоЗакрытоеПоСчету = Выборка.КоличествоЗакрытоеПоСчету;
		Движение.КоличествоЗакрытоеПотребности = Выборка.КоличествоЗакрытоеПотребности;
		
	КонецЦикла;    
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоЗначениямАвтозаполнения(ДанныеАвтоЗаполнения) 
	//Создает структуру с данными для заполнения реквизитов по умолчанию нового документа

	ДанныеАвтоЗаполнения = Новый Структура ();
	ДанныеАвтоЗаполнения.Вставить("Организация", ОрганизацииСерверУЗ.ОганизацияПоУмолчанию());
	ДанныеАвтоЗаполнения.Вставить("Валюта", ДокументыСервер.ВалютаПоУмолчанию());
	ДанныеАвтоЗаполнения.Вставить("Ответственный", КадрыСервер.ТекущийСотрудник());
	ДанныеАвтоЗаполнения.Вставить("ЦенаВключаетНДС", Истина);
	ДанныеАвтоЗаполнения.Вставить("Склад", ДокументыСервер.СкладПоУмолчанию());
	ДанныеАвтоЗаполнения.Вставить("СтавкаНДС", Перечисления.СтавкаНДС.НДС20);
	ДанныеАвтоЗаполнения.Вставить("Автор",КадрыСервер.ТекущийСотрудник()); 	
		
КонецПроцедуры

Функция ДанныеПровереныИГотовыКЗаписи()

	ДанныеГотовы = Истина;
	
	// Проверка на полное распределение товаров по счету.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетКонтрагентаТовары.НоменклатураПоставщика КАК НоменклатураПоставщика,
		|	СчетКонтрагентаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СУММА(ЕСТЬNULL(СчетКонтрагентаТовары.Количество, 0)) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТоварыПоСчету
		|ИЗ
		|	Документ.СчетКонтрагента.Товары КАК СчетКонтрагентаТовары
		|ГДЕ
		|	СчетКонтрагентаТовары.Ссылка = &СчетКонтрагента
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетКонтрагентаТовары.НоменклатураПоставщика,
		|	СчетКонтрагентаТовары.ЕдиницаИзмерения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетКонтрагентаЗакрытыеПотребности.НоменклатураПоставщика КАК НоменклатураПоставщика,
		|	СчетКонтрагентаЗакрытыеПотребности.ЕдиницаИзмеренияПоставщика КАК ЕдиницаИзмеренияПоставщика,
		|	СУММА(ЕСТЬNULL(СчетКонтрагентаЗакрытыеПотребности.КоличествоЗакрытоеПоСчету, 0)) КАК КоличествоЗакрытоеПоСчету
		|ПОМЕСТИТЬ ВТ_ЗакрытаяПотребность
		|ИЗ
		|	Документ.СчетКонтрагента.ЗакрытыеПотребности КАК СчетКонтрагентаЗакрытыеПотребности
		|ГДЕ
		|	СчетКонтрагентаЗакрытыеПотребности.Ссылка = &СчетКонтрагента
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетКонтрагентаЗакрытыеПотребности.НоменклатураПоставщика,
		|	СчетКонтрагентаЗакрытыеПотребности.ЕдиницаИзмеренияПоставщика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_ТоварыПоСчету.Количество, 0) - ЕСТЬNULL(ВТ_ЗакрытаяПотребность.КоличествоЗакрытоеПоСчету, 0) КАК ОсталосьРаспределить
		|ПОМЕСТИТЬ ВТ_ОсталосьРаспределить
		|ИЗ
		|	ВТ_ТоварыПоСчету КАК ВТ_ТоварыПоСчету
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЗакрытаяПотребность КАК ВТ_ЗакрытаяПотребность
		|		ПО ВТ_ТоварыПоСчету.НоменклатураПоставщика = ВТ_ЗакрытаяПотребность.НоменклатураПоставщика
		|			И ВТ_ТоварыПоСчету.ЕдиницаИзмерения = ВТ_ЗакрытаяПотребность.ЕдиницаИзмеренияПоставщика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсталосьРаспределить.ОсталосьРаспределить КАК ОсталосьРаспределить
		|ИЗ
		|	ВТ_ОсталосьРаспределить КАК ВТ_ОсталосьРаспределить
		|ГДЕ
		|	ВТ_ОсталосьРаспределить.ОсталосьРаспределить <> 0";
	
	Запрос.УстановитьПараметр("СчетКонтрагента", Ссылка);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		ДанныеГотовы = Ложь;	
		
	КонецЕсли;
				
	Возврат ДанныеГотовы;
	
КонецФункции

#КонецОбласти
